{
    "class_name": "Functional",
    "config": {
        "name": "model_2",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        64,
                        64,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_3"
                },
                "registered_name": null,
                "name": "input_3",
                "inbound_nodes": []
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block1_conv1",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64,
                        64,
                        3
                    ]
                },
                "name": "block1_conv1",
                "inbound_nodes": [
                    [
                        [
                            "input_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block1_conv2",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64,
                        64,
                        64
                    ]
                },
                "name": "block1_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block1_pool",
                    "trainable": false,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64,
                        64,
                        64
                    ]
                },
                "name": "block1_pool",
                "inbound_nodes": [
                    [
                        [
                            "block1_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block2_conv1",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        64
                    ]
                },
                "name": "block2_conv1",
                "inbound_nodes": [
                    [
                        [
                            "block1_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block2_conv2",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        128
                    ]
                },
                "name": "block2_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block2_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block2_pool",
                    "trainable": false,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32,
                        32,
                        128
                    ]
                },
                "name": "block2_pool",
                "inbound_nodes": [
                    [
                        [
                            "block2_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block3_conv1",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        16,
                        128
                    ]
                },
                "name": "block3_conv1",
                "inbound_nodes": [
                    [
                        [
                            "block2_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block3_conv2",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        16,
                        256
                    ]
                },
                "name": "block3_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block3_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block3_conv3",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        16,
                        256
                    ]
                },
                "name": "block3_conv3",
                "inbound_nodes": [
                    [
                        [
                            "block3_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block3_pool",
                    "trainable": false,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        16,
                        256
                    ]
                },
                "name": "block3_pool",
                "inbound_nodes": [
                    [
                        [
                            "block3_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block4_conv1",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        8,
                        8,
                        256
                    ]
                },
                "name": "block4_conv1",
                "inbound_nodes": [
                    [
                        [
                            "block3_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block4_conv2",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        8,
                        8,
                        512
                    ]
                },
                "name": "block4_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block4_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block4_conv3",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        8,
                        8,
                        512
                    ]
                },
                "name": "block4_conv3",
                "inbound_nodes": [
                    [
                        [
                            "block4_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block4_pool",
                    "trainable": false,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        8,
                        8,
                        512
                    ]
                },
                "name": "block4_pool",
                "inbound_nodes": [
                    [
                        [
                            "block4_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block5_conv1",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        4,
                        4,
                        512
                    ]
                },
                "name": "block5_conv1",
                "inbound_nodes": [
                    [
                        [
                            "block4_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block5_conv2",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        4,
                        4,
                        512
                    ]
                },
                "name": "block5_conv2",
                "inbound_nodes": [
                    [
                        [
                            "block5_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "block5_conv3",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        4,
                        4,
                        512
                    ]
                },
                "name": "block5_conv3",
                "inbound_nodes": [
                    [
                        [
                            "block5_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "block5_pool",
                    "trainable": false,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        4,
                        4,
                        512
                    ]
                },
                "name": "block5_pool",
                "inbound_nodes": [
                    [
                        [
                            "block5_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Flatten",
                "config": {
                    "name": "flatten_2",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        2,
                        2,
                        512
                    ]
                },
                "name": "flatten_2",
                "inbound_nodes": [
                    [
                        [
                            "block5_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_6",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        2048
                    ]
                },
                "name": "dense_6",
                "inbound_nodes": [
                    [
                        [
                            "flatten_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_4",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "dropout_4",
                "inbound_nodes": [
                    [
                        [
                            "dense_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_7",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "dense_7",
                "inbound_nodes": [
                    [
                        [
                            "dropout_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_5",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "dropout_5",
                "inbound_nodes": [
                    [
                        [
                            "dense_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_8",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 29,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "dense_8",
                "inbound_nodes": [
                    [
                        [
                            "dropout_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_3",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_8",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
}